# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [2]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [3]:
# Your code here
cur.execute('''SELECT firstname, lastname FROM employees JOIN offices USING(officeCode) WHERE city = 'Boston'; ''' )
df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [4]:
# Your code here
cur.execute('''SELECT 
o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
FROM offices AS o
LEFT JOIN employees AS e
USING(officeCode)
GROUP BY officeCode
HAVING n_employees = 0; ''' )
df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [5]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [6]:
# Your code here
cur.execute('''SELECT p.amount, c.customername FROM payments AS p 
JOIN customers as c 
USING(customerNumber)''')
df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df

       amount          customerName
0     6066.78     Atelier graphique
1    14571.44     Atelier graphique
2     1676.14     Atelier graphique
3    14191.12    Signal Gift Stores
4    32641.98    Signal Gift Stores
..        ...                   ...
268  59265.14  Diecast Collectables
269   6276.60  Diecast Collectables
270  30253.75     Kelly's Gift Shop
271  32077.44     Kelly's Gift Shop
272  52166.00     Kelly's Gift Shop

[273 rows x 2 columns]

In [10]:
# Your code here
cur.execute('''SELECT p.amount, o.comments, c.customerName 
FROM customers AS c 
JOIN payments AS p
USING(customerNumber)
JOIN orders AS o
USING(customerNumber)''')
df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df

,amount,comments,customerName
0,1676.14,,Atelier graphique
1,1676.14,,Atelier graphique
2,1676.14,,Atelier graphique
3,6066.78,,Atelier graphique
4,6066.78,,Atelier graphique
...,...,...,...
1272,32077.44,Customer cancelled due to urgent budgeting iss...,Kelly's Gift Shop
1273,52166.00,,Kelly's Gift Shop
1274,52166.00,,Kelly's Gift Shop
1275,52166.00,,Kelly's Gift Shop
1276,52166.00,Customer cancelled due to urgent budgeting iss...,Kelly's Gift Shop

In [9]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!